#ifndef _SOLVEMSG_H
#define _SOLVEMSG_H

//==================================================
//数据定义
//==================================================
//心跳包结构体、由服务端设置timer定时向服务端反馈agent的安全状态等基本信息
//格式
struct HeartNode
{
	char host[105];
	char time[105];
	char ip[20];
	int port;
	char cpu[50];
	char memory[10];
	char account[50];
	char process[50];
	char webshell[105];
};


//==================================================
//引用全局变量
//==================================================




//==================================================
//对外函数借口
//==================================================
void Tcp_Msg_Solve(char* msg);


#endif