#ifndef _TCP_H
#define _TCP_H

//==================================================
//数据定义
//==================================================
//云盾服务端IP端口列表
struct YunDunServerIP
{
	char ipstr[32]; //ip
	int port; //端口
	int level; //连接优先级
};


//==================================================
//引用全局变量
//==================================================




//==================================================
//对外函数借口
//==================================================
void Tcp_Init();

void Server_Interactive();

int SendMessage(char* buf); //-1失败、0成功

int RecvMessage(char* buf); //-1失败、0成功、1关闭连接


#endif
